#-*- coding:utf-8 -*-

# ----- sampling周期を設定 -----
SAMPLING = 0.01

# ----- color抽出modeを選択（ RGB:mode=0, HSV:mode=1 ） -----
MODE = 0

# ----- BGRで色の範囲を設定 :mode=0 -----
COLOR_BGR = [["Red", [0, 0, 230], [20, 20, 255]],
            ["Green", [0, 230, 0], [20, 255, 20]],
            ["Blue", [230, 0, 0], [255, 20, 20]]
            ]

# ----- HSVで色の範囲を設定 :mode=1 -----
COLOR_HSV = [["Blue", [230, 0, 0], [255, 20, 20]],
            ["Red", [0, 0, 230], [20, 20, 255]],
            ["Green", [0, 230, 0], [20, 255, 20]]
            ]

# ----- フィルタリング：使用する際は１以上の数値を設定（同時に複数使用不可） -----
BLUR = 0    # ブラーフィルタ
GAUSSIAN = 0    #ガウシアンフィルタ
MEDIAN = 0  # メディアンフィルタ
BILATERAL = 0   # バイラテラルフィルタ
